In [3]:
import pandas as pd
import numpy as np

employee_data = {
    'Name': ['John Doe', 'Jane Smith', 'Emily Davis'],
    'Salary': [50000, 60000, 55000],
    'City': ['New York', 'Los Angeles', 'Chicago']
}

df = pd.DataFrame(employee_data)
df

          Name  Salary         City
0     John Doe   50000     New York
1   Jane Smith   60000  Los Angeles
2  Emily Davis   55000      Chicago

In [4]:
df.to_csv("emp_data1.csv", index=False)

In [5]:
df.describe()

        Salary
count      3.0
mean   55000.0
std     5000.0
min    50000.0
25%    52500.0
50%    55000.0
75%    57500.0
max    60000.0

In [6]:
# df[col_name][index] -> that particular cell
# df[col_name][index] = new_val to modify a cell 
# but, df.loc[index, col_name] = new_val is better and recommended
# df[col_name] -> that particular column values will be shown as series
# df[in]

df = df.drop(1, axis=0)

df.loc["B","City"] = "Banglore"
df

          Name   Salary      City
0     John Doe  50000.0  New York
2  Emily Davis  55000.0   Chicago
B          NaN      NaN  Banglore

In [7]:
# df.index = [index_names]
df.index = ['A','B','C']
df

          Name   Salary      City
A     John Doe  50000.0  New York
B  Emily Davis  55000.0   Chicago
C          NaN      NaN  Banglore

In [8]:
# df.T # Transpose
# df.to_numpy() # converts dataframe into numpy array 
# axis = 0 # row
# axis = 1 # column
# df.sort_index(axis = 0, ascending = False) # sorts rows by index in Descending order
# df.sort_index(axis = 1) # sorts columns by index in Ascending order (if column is string then by ASCII value)
# df2 = df : df2 is like a pointer pointing to df, hence changes made in df2 will also affect df
# df2 = df[:] or df.copy() does shallow copy and hence a copy of df is created in df2